Repository: amrloulah-dev/wallet-manager-flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: ar

source: Contact Us
ar: تواصل معنا

source: WhatsApp
ar: واتساب

source: Email
ar: البريد الإلكتروني

# whatsappMessageRenew
source: Hello, I want to renew my Wallet Manager license
ar: مرحباً، أريد تجديد ترخيص تطبيق Wallet Manager

# emailSubjectRenew
source: Wallet Manager License Renewal
ar: تجديد ترخيص Wallet Manager

# emailBodyRenew
source: Hello, I want to renew my Wallet Manager license.
ar: مرحباً، أريد تجديد ترخيص تطبيق Wallet Manager.

# errorOpenWhatsapp
source: Cannot open WhatsApp
ar: لا يمكن فتح واتساب

# errorOpenEmail
source: Cannot open Email app
ar: لا يمكن فتح تطبيق البريد الإلكتروني

source: Settings
ar: الإعدادات

source: Account Info
ar: معلومات الحساب

source: User
ar: مستخدم

source: No email
ar: لا يوجد بريد إلكتروني

source: Owner
ar: مالك

source: Employee
ar: موظف

source: Store Name
ar: اسم المتجر

source: Creation Date
ar: تاريخ الإنشاء

source: License Info
ar: معلومات الترخيص

source: Expired
ar: منتهي

source: Active
ar: نشط

source: License Key
ar: مفتاح الترخيص

source: Expiry Date
ar: تاريخ الانتهاء

source: Days Remaining
ar: الأيام المتبقية

source: Day
ar: يوم

# contactToRenew
source: Contact us to renew license
ar: تواصل معنا لتجديد الترخيص

source: App Settings
ar: إعدادات التطبيق

source: Theme
ar: المظهر

source: License
ar: الترخيص

source: Not Available
ar: غير متوفر

source: Logout
ar: تسجيل الخروج

# logoutConfirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Exit
ar: خروج

source: Logout failed
ar: فشل تسجيل الخروج

source: Choose Theme
ar: اختر المظهر

source: Light
ar: فاتح

source: Dark
ar: غامق

source: System
ar: حسب النظام

# appDescription
source: An app to manage your financial wallets easily and securely.
ar: تطبيق لإدارة محافظك المالية بكل سهولة وأمان.

source: Error
ar: خطأ

source: Page not found.
ar: الصفحة المطلوبة غير موجودة.

source: Back
ar: الرجوع

source: Language
ar: اللغة

source: Choose Language
ar: اختر اللغة

source: Arabic
ar: العربية

source: Manage Wallets
ar: إدارة المحافظ

source: Login with Google
ar: تسجيل الدخول عبر جوجل

# noAccountLinked
source: No account linked to this email. Please complete registration.
ar: لا يوجد حساب مرتبط بهذا البريد. يرجى إكمال التسجيل.

# licenseKeyError
source: Error: License key not available. Please go back and check it.
ar: خطأ: مفتاح الترخيص غير متوفر. يرجى الرجوع والتحقق منه.

# activationFailed
source: Account created but license activation failed. Please contact support.
ar: تم إنشاء الحساب ولكن فشل تفعيل مفتاح الترخيص. يرجى التواصل مع الدعم الفني.

# loginSuccess
source: Logged in successfully!
ar: تم تسجيل الدخول بنجاح!

# createAccount
source: Create New Account
ar: إنشاء حساب جديد

source: Step 1: Store Info
ar: الخطوة 1: معلومات المحل

source: Next
ar: التالي

source: Or
ar: أو

# haveAccount
source: Already have an account? Login
ar: لديك حساب بالفعل؟ تسجيل الدخول

# noAccount
source: Don't have an account? Create new account
ar: ليس لديك حساب؟ إنشاء حساب جديد

source: Login as Employee
ar: تسجيل الدخول كموظف

source: Step 2: License Key
ar: الخطوة 2: مفتاح الترخيص

# getLicenseKey
source: To get a license key
ar: للحصول على مفتاح الترخيص

source: Contact us at:
ar: تواصل معنا على:

# enterLicenseKey
source: Enter the 21-character license key
ar: أدخل مفتاح الترخيص المكون من 21 حرف

# verifiedSuccess
source: Verified Successfully!
ar: تم التحقق بنجاح!

source: Verify Key
ar: تحقق من المفتاح

# step3Google
source: Final Step
ar: الخطوة الأخيرة

# linkGoogle
source: Link Google Account and Create Account
ar: ربط حساب جوجل وإنشاء الحساب

# createAccountGoogle
source: Create Account via Google
ar: إنشاء حساب جديد عبر جوجل

# enterValidLicense
source: Must enter a valid license key
ar: يجب إدخال مفتاح ترخيص صحيح

# invalidLicense
source: Invalid license key
ar: مفتاح الترخيص غير صحيح

# licenseUsed
source: License key already used
ar: مفتاح الترخيص مستخدم بالفعل

# verifySuccess
source: Key verified successfully
ar: تم التحقق من المفتاح بنجاح

# errorVerifying
source: Error verifying key
ar: حدث خطأ أثناء التحقق من المفتاح

# whatsappMessageLicense
source: Hello, I want to get a license key for Wallet Manager app
ar: مرحباً، أريد الحصول على مفتاح ترخيص لتطبيق Wallet Manager

# emailSubjectLicense
source: License Key Request
ar: طلب مفتاح ترخيص

# emailBodyLicense
source: Hello, I want to get a license key for Wallet Manager app
ar: مرحباً، أريد الحصول على مفتاح ترخيص لتطبيق Wallet Manager

# storeNameHint
source: Enter your store name
ar: أدخل اسم المحل الخاص بك

source: Store Password
ar: كلمة سر المحل

# storePasswordHint
source: Enter 6-digit password
ar: أدخل كلمة سر مكونة من 6 أرقام

source: Confirm Password
ar: تأكيد كلمة السر

# confirmPasswordHint
source: Re-enter password
ar: أعد إدخال كلمة السر

source: Employee Login
ar: تسجيل دخول الموظف

# step1StorePassword
source: Step 1: Enter Store Password
ar: الخطوة 1: أدخل كلمة سر المتجر

# step2Pin
source: Step 2: Enter Your PIN
ar: الخطوة 2: أدخل الرقم السري الخاص بك

# step3GoogleStore
source: Step 3: Login with Store Google Account
ar: الخطوة 3: سجل بحساب جوجل الخاص بالمتجر

# storePasswordInvalid
source: Incorrect store password
ar: كلمة سر المحل غير صحيحة

# pinInvalid
source: Incorrect PIN
ar: الرقم السري غير صحيح

source: Welcome
ar: مرحباً

# wrongGoogleAccount
source: Please login with the store's Google account.
ar: يرجى تسجيل الدخول بحساب جوجل الخاص بالمتجر.

# unexpectedError
source: Unexpected error occurred.
ar: حدث خطأ غير متوقع.

# contactToRenewBtn
source: Contact to Renew
ar: تواصل للتجديد

# areYouOwner
source: Are you the store owner? Login here
ar: هل أنت مالك المتجر؟ تسجيل الدخول من هنا

source: Verify
ar: تحقق

source: License Expired
ar: الترخيص منتهي

# licenseExpiredMessage
source: License must be renewed to continue.
ar: يجب تجديد الترخيص للمتابعة.

source: Renew License
ar: تجديد الترخيص

source: Cancel
ar: إلغاء

source: Good Morning 🌅
ar: صباح الخير 🌅

source: Good Afternoon ☀️
ar: مساء الخير ☀️

source: Good Evening 🌙
ar: مساء الخير 🌙

source: Home
ar: الرئيسية

source: New Transaction
ar: معاملة جديدة

source: Wallets
ar: المحافظ

source: Transactions
ar: المعاملات

source: Debts
ar: الديون

source: Statistics
ar: الإحصائيات

source: Manage Employees
ar: إدارة الموظفين

# errorLoadingStats
source: Cannot load statistics
ar: لا يمكن تحميل الإحصائيات

source: Total Wallets
ar: إجمالي المحافظ

source: Total Transactions
ar: إجمالي المعاملات

source: Total Commission
ar: إجمالي العمولات

source: Open Debts
ar: ديون مفتوحة

source: Last Updated:
ar: آخر تحديث:

source: New Wallet
ar: محفظة جديدة

source: New Debt
ar: دين جديد

source: View Wallets
ar: عرض المحافظ

source: View Debts
ar: عرض الديون

source: Quick Actions
ar: إجراءات سريعة

source: Alerts
ar: تنبيهات

# dailyLimitAlert
source: is about to reach daily sending limit.
ar: على وشك الوصول للحد اليومي للإرسال.

source: View Details
ar: عرض التفاصيل

# openDebtsAlert
source: You have {count} open debts.
ar: لديك {count} ديون مفتوحة.

source: Recent Transactions
ar: آخر المعاملات

source: View All
ar: عرض الكل

source: No transactions today.
ar: لا توجد معاملات اليوم.

source: Employee Dashboard
ar: لوحة تحكم الموظف

source: Available Actions
ar: الإجراءات المتاحة

source: Your Recent Transactions
ar: آخر معاملاتك

source: Error loading transactions
ar: حدث خطأ في تحميل المعاملات

# noTransactionsByYou
source: You haven't made any transactions today.
ar: لم تقم بأي معاملات اليوم.

# walletAlertMessage
source: Wallet {phone} is about to reach daily sending limit.
ar: محفظة {phone} على وشك الوصول للحد اليومي للإرسال.

source: Delete Wallet
ar: حذف المحفظة

# deleteWalletConfirmation
source: Are you sure you want to delete wallet {phone}?
ar: هل أنت متأكد أنك تريد حذف محفظة {phone}؟

source: Delete
ar: حذف

source: Wallet deleted successfully
ar: تم حذف المحفظة بنجاح

# walletDeletionFailed
source: Failed to delete wallet
ar: فشل حذف المحفظة

source: Something went wrong
ar: حدث خطأ ما

source: No wallets yet
ar: لا توجد محافظ بعد

# startAddingWallets
source: Start by adding a new wallet to manage your finances.
ar: ابدأ بإضافة محفظة جديدة لإدارة معاملاتك المالية.

source: Add Wallet
ar: إضافة محفظة

source: Add Balance
ar: إضافة رصيد

source: Active Wallets
ar: المحافظ النشطة

source: Search by phone number...
ar: ابحث برقم الموبايل...

source: Edit Wallet
ar: تعديل المحفظة

source: Add New Wallet
ar: إضافة محفظة جديدة

source: Phone Number
ar: رقم الموبايل

source: Initial Balance
ar: الرصيد المبدئي

source: Wallet Type
ar: نوع المحفظة

source: Select Wallet Type
ar: اختر نوع المحفظة

# walletTypeRequired
source: Wallet type is required
ar: نوع المحفظة مطلوب

source: Wallet Status
ar: حالة المحفظة

# newStatus
source: New
ar: جديدة

# oldStatus
source: Old
ar: قديمة

source: Registered Store
ar: محل مسجل

source: Wallet Limits
ar: حدود المحفظة

# dailyLimit
source: Transaction Limit (Send/Receive)
ar: حد المعاملة الواحدة (إرسال/استقبال)

# monthlyLimit
source: Monthly Limit (Send/Receive)
ar: الحد الشهري (إرسال/استقبال)

source: Notes (Optional)
ar: ملاحظات (اختياري)

# notesPlaceholder
source: Any additional details about the wallet
ar: أي تفاصيل إضافية عن المحفظة

source: Save Changes
ar: حفظ التعديلات

# addWalletAction
source: Add Wallet
ar: إضافة المحفظة

source: Please select wallet type
ar: يرجى اختيار نوع المحفظة

source: Please select wallet status
ar: يرجى اختيار حالة المحفظة

# authErrorRelogin
source: Authentication error, please login again
ar: خطأ في المصادقة، يرجى تسجيل الدخول مرة أخرى

source: Wallet updated successfully
ar: تم تعديل المحفظة بنجاح

source: Wallet added successfully
ar: تم إضافة المحفظة بنجاح

source: Vodafone Cash
ar: فودافون كاش

source: InstaPay
ar: إنستاباي

source: Orange Cash
ar: أورانج كاش

source: Etisalat Cash
ar: اتصالات كاش

source: Other
ar: أخرى

source: No wallet selected.
ar: لم يتم تحديد محفظة.

source: Wallet Details
ar: تفاصيل المحفظة

source: Edit
ar: تعديل

source: Loading wallet data...
ar: جاري تحميل بيانات المحفظة...

source: Error loading data.
ar: حدث خطأ أثناء تحميل البيانات.

source: Wallet not found.
ar: لم يتم العثور على المحفظة المطلوبة.

source: Send Limits
ar: حدود الإرسال

source: Receive Limits
ar: حدود الاستقبال

source: Current Balance
ar: الرصيد الحالي

source: Added Date
ar: تاريخ الإضافة

source: Notes
ar: ملاحظات

# dailyLimitSimple
source: Daily Limit
ar: الحد اليومي

# monthlyLimitSimple
source: Monthly Limit
ar: الحد الشهري

# sendLimitReachedMessage
source: Sending limit reached. Cannot send new amounts today/this month.
ar: تم الوصول للحد الأقصى للإرسال. لا يمكن إرسال مبالغ جديدة اليوم/هذا الشهر.

# receiveLimitReachedMessage
source: Receiving limit reached. Cannot receive new amounts today/this month.
ar: تم الوصول للحد الأقصى للاستقبال. لا يمكن استقبال مبالغ جديدة اليوم/هذا الشهر.

source: Confirm Deletion
ar: تأكيد الحذف

# deleteWalletConfirmationDetailed
source: Are you sure you want to delete wallet "{phone}"? The wallet will be hidden from the list but its past transactions will not be deleted.
ar: هل أنت متأكد أنك تريد حذف محفظة "{phone}"؟ سيتم إخفاء المحفظة من القائمة ولكن لن يتم حذف معاملاتها السابقة.

# pleaseSelectWalletFirst
source: Please select a wallet first
ar: يرجى اختيار محفظة أولاً

source: User not authenticated.
ar: المستخدم غير مسجل الدخول.

source: Balance added successfully
ar: تم إضافة الرصيد بنجاح

source: Failed to add balance
ar: فشل في إضافة الرصيد

source: Add Balance to Wallet
ar: إضافة رصيد لمحفظة

source: No wallets available.
ar: لا توجد محافظ متاحة.

source: Select Wallet
ar: اختر المحفظة

# selectWalletToAddBalance
source: Select the wallet to add balance to
ar: اختر المحفظة التي تريد إضافة رصيد لها

# pleaseSelectWallet
source: Please select a wallet
ar: يرجى اختيار محفظة

source: Selected Wallet Details
ar: تفاصيل المحفظة المحددة

# currentBalanceLabel
source: Current Balance:
ar: الرصيد الحالي:

source: Amount to Add
ar: المبلغ المراد إضافته

# addBalanceAction
source: Add Balance
ar: إضافة الرصيد

source: Transaction Fees
ar: رسوم المعاملة

source: Total Deduction
ar: إجمالي الخصم

source: Calculating fees...
ar: جاري حساب الرسوم...
